app/Controllers/Home.php

SELECT *
FROM `projects`
WHERE `status` = 'published'
AND `projects`.`deleted_at` IS NULL
ORDER BY `project_date` DESC
SELECT *
FROM `team`
WHERE `is_active` = 1
AND `team`.`deleted_at` IS NULL
ORDER BY `join_date` DESC
---
    public function index(): string
    {
        $data = [
            'meta_title' => 'KT-NEXUS Technologies - Innovative IT Solutions',
            'meta_description' => 'Leading IT solutions provider specializing in custom software development, web applications, and database management systems.',
            'meta_keywords' => 'IT solutions, software development, web applications, database management',

            'projects' => $this->projectModel
                ->where('status', 'published')
                ->orderBy('project_date', 'DESC')
                ->limit(3)
                ->findAll(),

            'team' => $this->teamModel
                ->where('is_active', 1)
                ->orderBy('join_date', 'DESC')
                ->limit(3)
                ->findAll()

SELECT *
FROM `team`
WHERE `is_active` = 1
AND `team`.`deleted_at` IS NULL
ORDER BY `join_date` ASC
---
    public function about(): string
    {
        $data = [
            'meta_title' => 'About KT-NEXUS Technologies - Our Story',
            'meta_description' => 'Since 2018, KT-NEXUS Technologies has been helping businesses transform through innovative technology solutions.',
            'meta_keywords' => 'about us, company history, IT solutions provider',

            'team' => $this->teamModel
                ->where('is_active', 1)
                ->orderBy('join_date', 'ASC')
                ->findAll()

SELECT *
FROM `projects`
WHERE `status` = 'published'
AND `projects`.`deleted_at` IS NULL
ORDER BY `project_date` DESC
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `projects`
WHERE `status` = 'published'
AND `projects`.`deleted_at` IS NULL
SELECT DISTINCT `category`
FROM `projects`
WHERE `status` = 'published'
AND `projects`.`deleted_at` IS NULL
---
    public function portfolio(): string
{
    // Get the current page from the URL query string
    $page = $this->request->getVar('page') ?? 1;

    // Configure pagination
    $perPage = 6; // Number of projects per page
    $pager = service('pager');

    // Get paginated projects
    $projects = $this->projectModel
        ->where('status', 'published')
        ->orderBy('project_date', 'DESC')
        ->paginate($perPage);

    // Get unique categories
    $categories = $this->projectModel
        ->distinct()
        ->select('category')
        ->where('status', 'published')
        ->findAll();